In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
df1 = DataFrame({'Altitude': [3912, 3002, 3894],
                'City': ['LA', 'NY', 'TB']})

df1

   Altitude City
0      3912   LA
1      3002   NY
2      3894   TB

In [3]:
state_map = {'LA': 'California', 'NY': 'New York', 'TB': 'Florida'} # create a new column mapping

In [8]:
df1['state'] = df1['City'].map(state_map) # add the state column to match with the 'City' values.

In [9]:
df1

   Altitude City       state
0      3912   LA  California
1      3002   NY    New York
2      3894   TB     Florida